morse = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..',
         ',': ',', '!': '!', '?': '?'}

revmorse = {
    ".-": "A", "-...": "B", "-.-.": "C", "-..": "D", ".": "E", "..-.": "F", "--.": "G", "....": "H", "..": "I", ".---": "J", "-.-": "K",
    ". -..": "L", "--": "M", "-.": "N",
    "---": "O", ".--.": "P", "--.-": "Q", ".-.": "R", "...": "S", "-": "T", "..-": "U", "...-": "V", ".--": "W", "-..-": "X", "-.--": "Y",
    "--..": "Z", ",": ",", "!": "!", "?": "?"
}


def main() -> str:
    print("Введите 1, если хотите зашифровать сообщение")
    print("Введите 2, если хотитие расшифровать сообщение")
    print("Введите 3, чтобы завершить программу")
    n = int(input())
    while True:
        if n == 1:
            print("Введите сообщение")
            print(" ".join(code(input())))
        elif n == 2:
            print("Введите сообщение")
            print("".join(decode(input())))
        if n == 3:
            exit()
        print("Введите 1, если хотите зашифровать сообщение")
        print("Введите 2, если хотитие расшифровать сообщение")
        print("Введите 3, чтобы завершить программу")
        n = int(input())


def decode(a):
    b = []
    for i in a.split():
        b.append(revmorse.get(i))
    return b


def code(a):
    b = []
    for i in a:
        b.append(morse.get(i))
    return b


main()
